; ModuleID = 'linux_bc/pass/CVE-2022-34913.ll'
source_filename = "/home/SVF-tools/SSE-TestCases/src/pass/CVE-2022-34913.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"Unable to open '%s'\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"fseek failed\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"ftell failed\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"fread failed\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @md2roff(i8* %docname, i8* %source) #0 !dbg !31 {
entry:
  %docname.addr = alloca i8*, align 8
  %source.addr = alloca i8*, align 8
  %p = alloca i8*, align 8
  %appname = alloca [64 x i8], align 16
  store i8* %docname, i8** %docname.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %docname.addr, metadata !38, metadata !DIExpression()), !dbg !39
  store i8* %source, i8** %source.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/SVF-tools/SSE-TestCases/src/pass/CVE-2022-34913.c", directory: "/home/SVF-tools/SSE-TestCases")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "_ISupper", value: 256)
!8 = !DIEnumerator(name: "_ISlower", value: 512)
!9 = !DIEnumerator(name: "_ISalpha", value: 1024)
!10 = !DIEnumerator(name: "_ISdigit", value: 2048)
!11 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!12 = !DIEnumerator(name: "_ISspace", value: 8192)
!13 = !DIEnumerator(name: "_ISprint", value: 16384)
!14 = !DIEnumerator(name: "_ISgraph", value: 32768)
!15 = !DIEnumerator(name: "_ISblank", value: 1)
!16 = !DIEnumerator(name: "_IScntrl", value: 2)
!17 = !DIEnumerator(name: "_ISpunct", value: 4)
!18 = !DIEnumerator(name: "_ISalnum", value: 8)
!19 = !{!20, !21, !22, !23}
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{i32 7, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{i32 7, !"uwtable", i32 1}
!29 = !{i32 7, !"frame-pointer", i32 2}
!30 = !{!"clang version 13.0.0"}
!31 = distinct !DISubprogram(name: "md2roff", scope: !32, file: !32, line: 18, type: !33, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !37)
!32 = !DIFile(filename: "src/pass/CVE-2022-34913.c", directory: "/home/SVF-tools/SSE-TestCases")
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!37 = !{}
!38 = !DILocalVariable(name: "docname", arg: 1, scope: !31, file: !32, line: 18, type: !35)
!39 = !DILocation(line: 18, column: 26, scope: !31)
!40 = !DILocalVariable(name: "source", arg: 2, scope: !31, file: !32, line: 18, type: !35)
!41 = !DILocation(line: 18, column: 47, scope: !31)
!42 = !DILocalVariable(name: "p", scope: !31, file: !32, line: 19, type: !35)
!43 = !DILocation(line: 19, column: 14, scope: !31)
!44 = !DILocation(line: 19, column: 18, scope: !31)
!45 = !DILocalVariable(name: "appname", scope: !31, file: !32, line: 20, type: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 64)
!49 = !DILocation(line: 20, column: 7, scope: !31)
!50 = !DILocation(line: 23, column: 3, scope: !51)
!51 = distinct !DILexicalBlock(scope: !52, file: !32, line: 22, column: 12)
!52 = distinct !DILexicalBlock(scope: !31, file: !32, line: 22, column: 6)
!53 = !DILocation(line: 23, column: 11, scope: !51)
!54 = !DILocation(line: 24, column: 6, scope: !55)
!55 = distinct !DILexicalBlock(scope: !51, file: !32, line: 23, column: 25)
!56 = distinct !{!56, !50, !57, !58}
!57 = !DILocation(line: 25, column: 3, scope: !51)
!58 = !{!"llvm.loop.mustprogress"}
!59 = !DILocation(line: 27, column: 7, scope: !60)
!60 = distinct !DILexicalBlock(scope: !51, file: !32, line: 27, column: 7)
!61 = !DILocation(line: 27, column: 12, scope: !60)
!62 = !DILocation(line: 27, column: 19, scope: !60)
!63 = !DILocation(line: 27, column: 23, scope: !60)
!64 = !DILocation(line: 27, column: 7, scope: !51)
!65 = !DILocation(line: 29, column: 11, scope: !66)
!66 = distinct !DILexicalBlock(scope: !60, file: !32, line: 27, column: 39)
!67 = !DILocation(line: 29, column: 20, scope: !66)
!68 = !DILocation(line: 29, column: 4, scope: !66)
!69 = !DILocation(line: 30, column: 3, scope: !66)
!70 = !DILocation(line: 32, column: 1, scope: !31)
!71 = distinct !DISubprogram(name: "loadfile", scope: !32, file: !32, line: 34, type: !72, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !37)
!72 = !DISubroutineType(types: !73)
!73 = !{!23, !35}
!74 = !DILocalVariable(name: "filename", arg: 1, scope: !71, file: !32, line: 34, type: !35)
!75 = !DILocation(line: 34, column: 28, scope: !71)
!76 = !DILocalVariable(name: "len", scope: !71, file: !32, line: 35, type: !20)
!77 = !DILocation(line: 35, column: 6, scope: !71)
!78 = !DILocalVariable(name: "fp", scope: !71, file: !32, line: 36, type: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !81, line: 7, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !102, !103, !104, !108, !109, !111, !115, !118, !120, !123, !126, !127, !128, !132, !133}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !83, line: 51, baseType: !20, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !82, file: !83, line: 54, baseType: !23, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !82, file: !83, line: 55, baseType: !23, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !82, file: !83, line: 56, baseType: !23, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !82, file: !83, line: 57, baseType: !23, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !82, file: !83, line: 58, baseType: !23, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !82, file: !83, line: 59, baseType: !23, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !82, file: !83, line: 60, baseType: !23, size: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !82, file: !83, line: 61, baseType: !23, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !82, file: !83, line: 64, baseType: !23, size: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !82, file: !83, line: 65, baseType: !23, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !82, file: !83, line: 66, baseType: !23, size: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !82, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !83, line: 36, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !82, file: !83, line: 70, baseType: !101, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !82, file: !83, line: 72, baseType: !20, size: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !82, file: !83, line: 73, baseType: !20, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !82, file: !83, line: 74, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !82, file: !83, line: 77, baseType: !21, size: 16, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !82, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !82, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !82, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !83, line: 43, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !107)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !82, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !83, line: 37, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !82, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !83, line: 38, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !82, file: !83, line: 93, baseType: !101, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !82, file: !83, line: 94, baseType: !22, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !82, file: !83, line: 95, baseType: !129, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "SVF/llvm-13.0.0.obj/lib/clang/13.0.0/include/stddef.h", directory: "/home/SVF-tools")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !82, file: !83, line: 96, baseType: !20, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !82, file: !83, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 36, column: 8, scope: !71)
!138 = !DILocalVariable(name: "buf", scope: !71, file: !32, line: 37, type: !23)
!139 = !DILocation(line: 37, column: 8, scope: !71)
!140 = !DILocation(line: 39, column: 7, scope: !141)
!141 = distinct !DILexicalBlock(scope: !71, file: !32, line: 39, column: 7)
!142 = !DILocation(line: 39, column: 16, scope: !141)
!143 = !DILocation(line: 39, column: 7, scope: !71)
!144 = !DILocation(line: 40, column: 14, scope: !145)
!145 = distinct !DILexicalBlock(scope: !141, file: !32, line: 39, column: 26)
!146 = !DILocation(line: 40, column: 8, scope: !145)
!147 = !DILocation(line: 40, column: 6, scope: !145)
!148 = !DILocation(line: 41, column: 7, scope: !149)
!149 = distinct !DILexicalBlock(scope: !145, file: !32, line: 41, column: 7)
!150 = !DILocation(line: 41, column: 10, scope: !149)
!151 = !DILocation(line: 41, column: 7, scope: !145)
!152 = !DILocation(line: 42, column: 34, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !32, line: 41, column: 19)
!154 = !DILocation(line: 42, column: 4, scope: !153)
!155 = !DILocation(line: 43, column: 4, scope: !153)
!156 = !DILocation(line: 45, column: 13, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !32, line: 45, column: 7)
!158 = !DILocation(line: 45, column: 7, scope: !157)
!159 = !DILocation(line: 45, column: 31, scope: !157)
!160 = !DILocation(line: 45, column: 7, scope: !145)
!161 = !DILocation(line: 46, column: 4, scope: !162)
!162 = distinct !DILexicalBlock(scope: !157, file: !32, line: 45, column: 38)
!163 = !DILocation(line: 47, column: 4, scope: !162)
!164 = !DILocation(line: 49, column: 15, scope: !145)
!165 = !DILocation(line: 49, column: 9, scope: !145)
!166 = !DILocation(line: 49, column: 7, scope: !145)
!167 = !DILocation(line: 50, column: 7, scope: !168)
!168 = distinct !DILexicalBlock(scope: !145, file: !32, line: 50, column: 7)
!169 = !DILocation(line: 50, column: 11, scope: !168)
!170 = !DILocation(line: 50, column: 7, scope: !145)
!171 = !DILocation(line: 51, column: 4, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !32, line: 50, column: 18)
!173 = !DILocation(line: 52, column: 4, scope: !172)
!174 = !DILocation(line: 54, column: 12, scope: !175)
!175 = distinct !DILexicalBlock(scope: !145, file: !32, line: 54, column: 6)
!176 = !DILocation(line: 54, column: 6, scope: !175)
!177 = !DILocation(line: 54, column: 30, scope: !175)
!178 = !DILocation(line: 54, column: 6, scope: !145)
!179 = !DILocation(line: 55, column: 4, scope: !180)
!180 = distinct !DILexicalBlock(scope: !175, file: !32, line: 54, column: 37)
!181 = !DILocation(line: 56, column: 4, scope: !180)
!182 = !DILocation(line: 58, column: 25, scope: !145)
!183 = !DILocation(line: 58, column: 28, scope: !145)
!184 = !DILocation(line: 58, column: 18, scope: !145)
!185 = !DILocation(line: 58, column: 7, scope: !145)
!186 = !DILocation(line: 59, column: 12, scope: !187)
!187 = distinct !DILexicalBlock(scope: !145, file: !32, line: 59, column: 6)
!188 = !DILocation(line: 59, column: 17, scope: !187)
!189 = !DILocation(line: 59, column: 25, scope: !187)
!190 = !DILocation(line: 59, column: 6, scope: !187)
!191 = !DILocation(line: 59, column: 29, scope: !187)
!192 = !DILocation(line: 59, column: 6, scope: !145)
!193 = !DILocation(line: 60, column: 4, scope: !194)
!194 = distinct !DILexicalBlock(scope: !187, file: !32, line: 59, column: 36)
!195 = !DILocation(line: 61, column: 4, scope: !194)
!196 = !DILocation(line: 63, column: 3, scope: !145)
!197 = !DILocation(line: 63, column: 7, scope: !145)
!198 = !DILocation(line: 63, column: 12, scope: !145)
!199 = !DILocation(line: 64, column: 10, scope: !145)
!200 = !DILocation(line: 64, column: 3, scope: !145)
