; ModuleID = 'mac_bc/pass/CVE-2022-34913.ll'
source_filename = "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/pass/CVE-2022-34913.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx12.0.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"Unable to open '%s'\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"fseek failed\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"ftell failed\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"fread failed\00", align 1

; Function Attrs: noinline nounwind optnone ssp uwtable
define void @md2roff(i8* noundef %docname, i8* noundef %source) #0 !dbg !13 {
entry:
  %docname.addr = alloca i8*, align 8
  %source.addr = alloca i8*, align 8
  %p = alloca i8*, align 8
  %appname = alloca [64 x i8], align 16
  store i8* %docname, i8** %docname.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %docname.addr, metadata !20, metadata !DIExpression()), !dbg !21
  store i8* %source, i8** %source.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Homebrew clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk", sdk: "MacOSX12.sdk")
!1 = !DIFile(filename: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/pass/CVE-2022-34913.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!2 = !{!3, !4}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 7, !"PIC Level", i32 2}
!10 = !{i32 7, !"uwtable", i32 1}
!11 = !{i32 7, !"frame-pointer", i32 2}
!12 = !{!"Homebrew clang version 14.0.6"}
!13 = distinct !DISubprogram(name: "md2roff", scope: !14, file: !14, line: 18, type: !15, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !19)
!14 = !DIFile(filename: "src/pass/CVE-2022-34913.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!19 = !{}
!20 = !DILocalVariable(name: "docname", arg: 1, scope: !13, file: !14, line: 18, type: !17)
!21 = !DILocation(line: 18, column: 26, scope: !13)
!22 = !DILocalVariable(name: "source", arg: 2, scope: !13, file: !14, line: 18, type: !17)
!23 = !DILocation(line: 18, column: 47, scope: !13)
!24 = !DILocalVariable(name: "p", scope: !13, file: !14, line: 19, type: !17)
!25 = !DILocation(line: 19, column: 14, scope: !13)
!26 = !DILocation(line: 19, column: 18, scope: !13)
!27 = !DILocalVariable(name: "appname", scope: !13, file: !14, line: 20, type: !28)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 64)
!31 = !DILocation(line: 20, column: 7, scope: !13)
!32 = !DILocation(line: 23, column: 3, scope: !33)
!33 = distinct !DILexicalBlock(scope: !34, file: !14, line: 22, column: 12)
!34 = distinct !DILexicalBlock(scope: !13, file: !14, line: 22, column: 6)
!35 = !DILocation(line: 23, column: 20, scope: !33)
!36 = !DILocation(line: 23, column: 19, scope: !33)
!37 = !DILocation(line: 23, column: 11, scope: !33)
!38 = !DILocation(line: 24, column: 6, scope: !39)
!39 = distinct !DILexicalBlock(scope: !33, file: !14, line: 23, column: 25)
!40 = distinct !{!40, !32, !41, !42}
!41 = !DILocation(line: 25, column: 3, scope: !33)
!42 = !{!"llvm.loop.mustprogress"}
!43 = !DILocation(line: 27, column: 7, scope: !44)
!44 = distinct !DILexicalBlock(scope: !33, file: !14, line: 27, column: 7)
!45 = !DILocation(line: 27, column: 12, scope: !44)
!46 = !DILocation(line: 27, column: 19, scope: !44)
!47 = !DILocation(line: 27, column: 31, scope: !44)
!48 = !DILocation(line: 27, column: 23, scope: !44)
!49 = !DILocation(line: 27, column: 7, scope: !33)
!50 = !DILocation(line: 29, column: 4, scope: !51)
!51 = distinct !DILexicalBlock(scope: !44, file: !14, line: 27, column: 39)
!52 = !DILocation(line: 30, column: 3, scope: !51)
!53 = !DILocation(line: 32, column: 1, scope: !13)
!54 = distinct !DISubprogram(name: "loadfile", scope: !14, file: !14, line: 34, type: !55, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !19)
!55 = !DISubroutineType(types: !56)
!56 = !{!4, !17}
!57 = !DILocalVariable(name: "filename", arg: 1, scope: !54, file: !14, line: 34, type: !17)
!58 = !DILocation(line: 34, column: 28, scope: !54)
!59 = !DILocalVariable(name: "len", scope: !54, file: !14, line: 35, type: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DILocation(line: 35, column: 6, scope: !54)
!62 = !DILocalVariable(name: "fp", scope: !54, file: !14, line: 36, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 157, baseType: !66)
!65 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !65, line: 126, size: 1216, elements: !67)
!67 = !{!68, !71, !72, !73, !75, !76, !81, !82, !83, !87, !91, !101, !105, !106, !109, !110, !114, !118, !119, !120}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !66, file: !65, line: 127, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !66, file: !65, line: 128, baseType: !60, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !66, file: !65, line: 129, baseType: !60, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !65, line: 130, baseType: !74, size: 16, offset: 128)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !66, file: !65, line: 131, baseType: !74, size: 16, offset: 144)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !66, file: !65, line: 132, baseType: !77, size: 128, offset: 192)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !65, line: 92, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !77, file: !65, line: 93, baseType: !69, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !77, file: !65, line: 94, baseType: !60, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !66, file: !65, line: 133, baseType: !60, size: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !66, file: !65, line: 136, baseType: !3, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !66, file: !65, line: 137, baseType: !84, size: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!60, !3}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !66, file: !65, line: 138, baseType: !88, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!60, !3, !4, !60}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !66, file: !65, line: 139, baseType: !92, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !3, !95, !60}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !65, line: 81, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !97, line: 71, baseType: !98)
!97 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !99, line: 48, baseType: !100)
!99 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/i386/_types.h", directory: "")
!100 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !66, file: !65, line: 140, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!60, !3, !17, !60}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !66, file: !65, line: 143, baseType: !77, size: 128, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !66, file: !65, line: 144, baseType: !107, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !65, line: 98, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !66, file: !65, line: 145, baseType: !60, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !66, file: !65, line: 148, baseType: !111, size: 24, offset: 928)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 3)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !66, file: !65, line: 149, baseType: !115, size: 8, offset: 952)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !66, file: !65, line: 152, baseType: !77, size: 128, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !66, file: !65, line: 155, baseType: !60, size: 32, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !65, line: 156, baseType: !95, size: 64, offset: 1152)
!121 = !DILocation(line: 36, column: 8, scope: !54)
!122 = !DILocalVariable(name: "buf", scope: !54, file: !14, line: 37, type: !4)
!123 = !DILocation(line: 37, column: 8, scope: !54)
!124 = !DILocation(line: 39, column: 7, scope: !125)
!125 = distinct !DILexicalBlock(scope: !54, file: !14, line: 39, column: 7)
!126 = !DILocation(line: 39, column: 16, scope: !125)
!127 = !DILocation(line: 39, column: 7, scope: !54)
!128 = !DILocation(line: 40, column: 14, scope: !129)
!129 = distinct !DILexicalBlock(scope: !125, file: !14, line: 39, column: 26)
!130 = !DILocation(line: 40, column: 8, scope: !129)
!131 = !DILocation(line: 40, column: 6, scope: !129)
!132 = !DILocation(line: 41, column: 7, scope: !133)
!133 = distinct !DILexicalBlock(scope: !129, file: !14, line: 41, column: 7)
!134 = !DILocation(line: 41, column: 10, scope: !133)
!135 = !DILocation(line: 41, column: 7, scope: !129)
!136 = !DILocation(line: 42, column: 34, scope: !137)
!137 = distinct !DILexicalBlock(scope: !133, file: !14, line: 41, column: 19)
!138 = !DILocation(line: 42, column: 4, scope: !137)
!139 = !DILocation(line: 43, column: 4, scope: !137)
!140 = !DILocation(line: 45, column: 13, scope: !141)
!141 = distinct !DILexicalBlock(scope: !129, file: !14, line: 45, column: 7)
!142 = !DILocation(line: 45, column: 7, scope: !141)
!143 = !DILocation(line: 45, column: 31, scope: !141)
!144 = !DILocation(line: 45, column: 7, scope: !129)
!145 = !DILocation(line: 46, column: 4, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !14, line: 45, column: 38)
!147 = !DILocation(line: 47, column: 4, scope: !146)
!148 = !DILocation(line: 49, column: 15, scope: !129)
!149 = !DILocation(line: 49, column: 9, scope: !129)
!150 = !DILocation(line: 49, column: 7, scope: !129)
!151 = !DILocation(line: 50, column: 7, scope: !152)
!152 = distinct !DILexicalBlock(scope: !129, file: !14, line: 50, column: 7)
!153 = !DILocation(line: 50, column: 11, scope: !152)
!154 = !DILocation(line: 50, column: 7, scope: !129)
!155 = !DILocation(line: 51, column: 4, scope: !156)
!156 = distinct !DILexicalBlock(scope: !152, file: !14, line: 50, column: 18)
!157 = !DILocation(line: 52, column: 4, scope: !156)
!158 = !DILocation(line: 54, column: 12, scope: !159)
!159 = distinct !DILexicalBlock(scope: !129, file: !14, line: 54, column: 6)
!160 = !DILocation(line: 54, column: 6, scope: !159)
!161 = !DILocation(line: 54, column: 30, scope: !159)
!162 = !DILocation(line: 54, column: 6, scope: !129)
!163 = !DILocation(line: 55, column: 4, scope: !164)
!164 = distinct !DILexicalBlock(scope: !159, file: !14, line: 54, column: 37)
!165 = !DILocation(line: 56, column: 4, scope: !164)
!166 = !DILocation(line: 58, column: 25, scope: !129)
!167 = !DILocation(line: 58, column: 28, scope: !129)
!168 = !DILocation(line: 58, column: 18, scope: !129)
!169 = !DILocation(line: 58, column: 7, scope: !129)
!170 = !DILocation(line: 59, column: 12, scope: !171)
!171 = distinct !DILexicalBlock(scope: !129, file: !14, line: 59, column: 6)
!172 = !DILocation(line: 59, column: 17, scope: !171)
!173 = !DILocation(line: 59, column: 25, scope: !171)
!174 = !DILocation(line: 59, column: 6, scope: !171)
!175 = !DILocation(line: 59, column: 29, scope: !171)
!176 = !DILocation(line: 59, column: 6, scope: !129)
!177 = !DILocation(line: 60, column: 4, scope: !178)
!178 = distinct !DILexicalBlock(scope: !171, file: !14, line: 59, column: 36)
!179 = !DILocation(line: 61, column: 4, scope: !178)
!180 = !DILocation(line: 63, column: 3, scope: !129)
!181 = !DILocation(line: 63, column: 7, scope: !129)
!182 = !DILocation(line: 63, column: 12, scope: !129)
!183 = !DILocation(line: 64, column: 10, scope: !129)
!184 = !DILocation(line: 64, column: 3, scope: !129)
!185 = !DILocation(line: 65, column: 2, scope: !129)
!186 = !DILocation(line: 67, column: 9, scope: !54)
!187 = !DILocation(line: 67, column: 2, scope: !54)
