; ModuleID = 'mac_bc/ikos_cases/fileread4.ll'
source_filename = "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/ikos_cases/fileread4.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx12.0.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.BitStream = type { %struct.__sFILE*, i32, i32, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1

; Function Attrs: noinline nounwind optnone ssp uwtable
define i32 @main(i32 noundef %argc, i8** noundef %argv) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %argc.addr = alloca i32, align 4
  %argv.addr = alloca i8**, align 8
  %inFileName = alloca [35 x i8], align 16
  %bStart = alloca [35 x i32], align 16
  %bEnd = alloca [35 x i32], align 16
  %inFile = alloca %struct.__sFILE*, align 8
  %outFile = alloca %struct.__sFILE*, align 8
  %b = alloca i32, align 4
  %bsIn = alloca %struct.BitStream*, align 8
  %bsWr = alloca %struct.BitStream*, align 8
  %bitsRead = alloca i32, align 4
  %buffHi = alloca i32, align 4
  %buffLo = alloca i32, align 4
  %blockCRC = alloca i32, align 4
  %currBlock = alloca i32, align 4
  %str = alloca [60 x i8], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Homebrew clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk", sdk: "MacOSX12.sdk")
!1 = !DIFile(filename: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/ikos_cases/fileread4.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!2 = !{!3}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !{i32 7, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 1, !"wchar_size", i32 4}
!7 = !{i32 7, !"PIC Level", i32 2}
!8 = !{i32 7, !"uwtable", i32 1}
!9 = !{i32 7, !"frame-pointer", i32 2}
!10 = !{!"Homebrew clang version 14.0.6"}
!11 = distinct !DISubprogram(name: "main", scope: !12, file: !12, line: 49, type: !13, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !19)
!12 = !DIFile(filename: "src/ikos_cases/fileread4.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !16}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !{}
!20 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !12, line: 49, type: !15)
!21 = !DILocation(line: 49, column: 14, scope: !11)
!22 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !12, line: 49, type: !16)
!23 = !DILocation(line: 49, column: 27, scope: !11)
!24 = !DILocalVariable(name: "inFileName", scope: !11, file: !12, line: 50, type: !25)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 280, elements: !27)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !12, line: 6, baseType: !18)
!27 = !{!28}
!28 = !DISubrange(count: 35)
!29 = !DILocation(line: 50, column: 10, scope: !11)
!30 = !DILocalVariable(name: "bStart", scope: !11, file: !12, line: 51, type: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1120, elements: !27)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !12, line: 4, baseType: !15)
!33 = !DILocation(line: 51, column: 11, scope: !11)
!34 = !DILocalVariable(name: "bEnd", scope: !11, file: !12, line: 52, type: !31)
!35 = !DILocation(line: 52, column: 11, scope: !11)
!36 = !DILocalVariable(name: "inFile", scope: !11, file: !12, line: 53, type: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 157, baseType: !40)
!39 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !39, line: 126, size: 1216, elements: !41)
!41 = !{!42, !45, !46, !47, !49, !50, !55, !56, !57, !61, !65, !75, !81, !82, !85, !86, !90, !94, !95, !96}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !40, file: !39, line: 127, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !40, file: !39, line: 128, baseType: !15, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !40, file: !39, line: 129, baseType: !15, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !39, line: 130, baseType: !48, size: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !40, file: !39, line: 131, baseType: !48, size: 16, offset: 144)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !40, file: !39, line: 132, baseType: !51, size: 128, offset: 192)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !39, line: 92, size: 128, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !51, file: !39, line: 93, baseType: !43, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !51, file: !39, line: 94, baseType: !15, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !40, file: !39, line: 133, baseType: !15, size: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !40, file: !39, line: 136, baseType: !3, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !40, file: !39, line: 137, baseType: !58, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!15, !3}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !40, file: !39, line: 138, baseType: !62, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!15, !3, !17, !15}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !40, file: !39, line: 139, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !3, !69, !15}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !39, line: 81, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !71, line: 71, baseType: !72)
!71 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/i386/_types.h", directory: "")
!74 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !40, file: !39, line: 140, baseType: !76, size: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!15, !3, !79, !15}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !40, file: !39, line: 143, baseType: !51, size: 128, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !40, file: !39, line: 144, baseType: !83, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !39, line: 98, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !40, file: !39, line: 145, baseType: !15, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !40, file: !39, line: 148, baseType: !87, size: 24, offset: 928)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !40, file: !39, line: 149, baseType: !91, size: 8, offset: 952)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !40, file: !39, line: 152, baseType: !51, size: 128, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !40, file: !39, line: 155, baseType: !15, size: 32, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !39, line: 156, baseType: !69, size: 64, offset: 1152)
!97 = !DILocation(line: 53, column: 17, scope: !11)
!98 = !DILocalVariable(name: "outFile", scope: !11, file: !12, line: 54, type: !37)
!99 = !DILocation(line: 54, column: 17, scope: !11)
!100 = !DILocalVariable(name: "b", scope: !11, file: !12, line: 55, type: !32)
!101 = !DILocation(line: 55, column: 12, scope: !11)
!102 = !DILocalVariable(name: "bsIn", scope: !11, file: !12, line: 56, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitStream", file: !12, line: 19, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 14, size: 192, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !105, file: !12, line: 15, baseType: !37, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !105, file: !12, line: 16, baseType: !32, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "buffLive", scope: !105, file: !12, line: 17, baseType: !32, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !12, line: 18, baseType: !26, size: 8, offset: 128)
!111 = !DILocation(line: 56, column: 17, scope: !11)
!112 = !DILocalVariable(name: "bsWr", scope: !11, file: !12, line: 56, type: !103)
!113 = !DILocation(line: 56, column: 24, scope: !11)
!114 = !DILocalVariable(name: "bitsRead", scope: !11, file: !12, line: 57, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !12, line: 3, baseType: !116)
!116 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!117 = !DILocation(line: 57, column: 17, scope: !11)
!118 = !DILocalVariable(name: "buffHi", scope: !11, file: !12, line: 57, type: !115)
!119 = !DILocation(line: 57, column: 27, scope: !11)
!120 = !DILocalVariable(name: "buffLo", scope: !11, file: !12, line: 57, type: !115)
!121 = !DILocation(line: 57, column: 35, scope: !11)
!122 = !DILocalVariable(name: "blockCRC", scope: !11, file: !12, line: 57, type: !115)
!123 = !DILocation(line: 57, column: 43, scope: !11)
!124 = !DILocalVariable(name: "currBlock", scope: !11, file: !12, line: 57, type: !115)
!125 = !DILocation(line: 57, column: 53, scope: !11)
!126 = !DILocalVariable(name: "str", scope: !11, file: !12, line: 58, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 480, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 60)
!130 = !DILocation(line: 58, column: 10, scope: !11)
!131 = !DILocation(line: 60, column: 22, scope: !11)
!132 = !DILocation(line: 60, column: 14, scope: !11)
!133 = !DILocation(line: 60, column: 12, scope: !11)
!134 = !DILocation(line: 61, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !11, file: !12, line: 61, column: 9)
!136 = !DILocation(line: 61, column: 16, scope: !135)
!137 = !DILocation(line: 61, column: 9, scope: !11)
!138 = !DILocation(line: 62, column: 9, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !12, line: 61, column: 25)
!140 = !DILocation(line: 64, column: 31, scope: !11)
!141 = !DILocation(line: 64, column: 12, scope: !11)
!142 = !DILocation(line: 64, column: 10, scope: !11)
!143 = !DILocation(line: 66, column: 14, scope: !11)
!144 = !DILocation(line: 67, column: 21, scope: !11)
!145 = !DILocation(line: 67, column: 12, scope: !11)
!146 = !DILocation(line: 68, column: 15, scope: !11)
!147 = !DILocation(line: 69, column: 12, scope: !11)
!148 = !DILocation(line: 69, column: 5, scope: !11)
!149 = !DILocation(line: 69, column: 23, scope: !11)
!150 = !DILocation(line: 70, column: 5, scope: !11)
!151 = !DILocation(line: 71, column: 22, scope: !152)
!152 = distinct !DILexicalBlock(scope: !11, file: !12, line: 70, column: 15)
!153 = !DILocation(line: 71, column: 13, scope: !152)
!154 = !DILocation(line: 71, column: 11, scope: !152)
!155 = !DILocation(line: 72, column: 17, scope: !152)
!156 = !DILocation(line: 73, column: 13, scope: !157)
!157 = distinct !DILexicalBlock(scope: !152, file: !12, line: 73, column: 13)
!158 = !DILocation(line: 73, column: 15, scope: !157)
!159 = !DILocation(line: 73, column: 13, scope: !152)
!160 = !DILocation(line: 74, column: 17, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !12, line: 74, column: 17)
!162 = distinct !DILexicalBlock(scope: !157, file: !12, line: 73, column: 21)
!163 = !DILocation(line: 74, column: 36, scope: !161)
!164 = !DILocation(line: 74, column: 29, scope: !161)
!165 = !DILocation(line: 74, column: 26, scope: !161)
!166 = !DILocation(line: 74, column: 47, scope: !161)
!167 = !DILocation(line: 75, column: 18, scope: !161)
!168 = !DILocation(line: 75, column: 36, scope: !161)
!169 = !DILocation(line: 75, column: 29, scope: !161)
!170 = !DILocation(line: 75, column: 27, scope: !161)
!171 = !DILocation(line: 75, column: 48, scope: !161)
!172 = !DILocation(line: 74, column: 17, scope: !162)
!173 = !DILocation(line: 76, column: 35, scope: !161)
!174 = !DILocation(line: 76, column: 43, scope: !161)
!175 = !DILocation(line: 76, column: 22, scope: !161)
