; ModuleID = 'mac_bc/ikos_cases/fileread3.ll'
source_filename = "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/ikos_cases/fileread3.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx12.0.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.BitStream = type { %struct.__sFILE*, i32, i32, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1

; Function Attrs: noinline nounwind optnone ssp uwtable
define i32 @main(i32 noundef %argc, i8** noundef %argv) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %argc.addr = alloca i32, align 4
  %argv.addr = alloca i8**, align 8
  %inFileName = alloca [35 x i8], align 16
  %bStart = alloca [35 x i32], align 16
  %inFile = alloca %struct.__sFILE*, align 8
  %outFile = alloca %struct.__sFILE*, align 8
  %b = alloca i32, align 4
  %bsIn = alloca %struct.BitStream*, align 8
  %bsWr = alloca %struct.BitStream*, align 8
  %bitsRead = alloca i32, align 4
  %buffHi = alloca i32, align 4
  %buffLo = alloca i32, align 4
  %blockCRC = alloca i32, align 4
  %currBlock = alloca i32, align 4
  %str = alloca [60 x i8], align 16
  store i32 0, i32* %retval, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Homebrew clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk", sdk: "MacOSX12.sdk")
!1 = !DIFile(filename: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases/src/ikos_cases/fileread3.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!2 = !{!3}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !{i32 7, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 1, !"wchar_size", i32 4}
!7 = !{i32 7, !"PIC Level", i32 2}
!8 = !{i32 7, !"uwtable", i32 1}
!9 = !{i32 7, !"frame-pointer", i32 2}
!10 = !{!"Homebrew clang version 14.0.6"}
!11 = distinct !DISubprogram(name: "main", scope: !12, file: !12, line: 43, type: !13, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !19)
!12 = !DIFile(filename: "src/ikos_cases/fileread3.c", directory: "/Users/jiaweiwang/CLionProjects/0130-db/svf-z3/SSE-TestCases")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !16}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !{}
!20 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !12, line: 43, type: !15)
!21 = !DILocation(line: 43, column: 14, scope: !11)
!22 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !12, line: 43, type: !16)
!23 = !DILocation(line: 43, column: 27, scope: !11)
!24 = !DILocalVariable(name: "inFileName", scope: !11, file: !12, line: 44, type: !25)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 280, elements: !27)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !12, line: 5, baseType: !18)
!27 = !{!28}
!28 = !DISubrange(count: 35)
!29 = !DILocation(line: 44, column: 10, scope: !11)
!30 = !DILocalVariable(name: "bStart", scope: !11, file: !12, line: 45, type: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1120, elements: !27)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !12, line: 3, baseType: !15)
!33 = !DILocation(line: 45, column: 11, scope: !11)
!34 = !DILocalVariable(name: "inFile", scope: !11, file: !12, line: 46, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 157, baseType: !38)
!37 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !37, line: 126, size: 1216, elements: !39)
!39 = !{!40, !43, !44, !45, !47, !48, !53, !54, !55, !59, !63, !73, !79, !80, !83, !84, !88, !92, !93, !94}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !38, file: !37, line: 127, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !38, file: !37, line: 128, baseType: !15, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !38, file: !37, line: 129, baseType: !15, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !37, line: 130, baseType: !46, size: 16, offset: 128)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !38, file: !37, line: 131, baseType: !46, size: 16, offset: 144)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !38, file: !37, line: 132, baseType: !49, size: 128, offset: 192)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !37, line: 92, size: 128, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !49, file: !37, line: 93, baseType: !41, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !49, file: !37, line: 94, baseType: !15, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !38, file: !37, line: 133, baseType: !15, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !38, file: !37, line: 136, baseType: !3, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !38, file: !37, line: 137, baseType: !56, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!15, !3}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !38, file: !37, line: 138, baseType: !60, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!15, !3, !17, !15}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !38, file: !37, line: 139, baseType: !64, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !3, !67, !15}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !37, line: 81, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !69, line: 71, baseType: !70)
!69 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !71, line: 48, baseType: !72)
!71 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/i386/_types.h", directory: "")
!72 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !38, file: !37, line: 140, baseType: !74, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!15, !3, !77, !15}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !38, file: !37, line: 143, baseType: !49, size: 128, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !38, file: !37, line: 144, baseType: !81, size: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !37, line: 98, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !38, file: !37, line: 145, baseType: !15, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !38, file: !37, line: 148, baseType: !85, size: 24, offset: 928)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 24, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !38, file: !37, line: 149, baseType: !89, size: 8, offset: 952)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !38, file: !37, line: 152, baseType: !49, size: 128, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !38, file: !37, line: 155, baseType: !15, size: 32, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !37, line: 156, baseType: !67, size: 64, offset: 1152)
!95 = !DILocation(line: 46, column: 17, scope: !11)
!96 = !DILocalVariable(name: "outFile", scope: !11, file: !12, line: 47, type: !35)
!97 = !DILocation(line: 47, column: 17, scope: !11)
!98 = !DILocalVariable(name: "b", scope: !11, file: !12, line: 48, type: !32)
!99 = !DILocation(line: 48, column: 12, scope: !11)
!100 = !DILocalVariable(name: "bsIn", scope: !11, file: !12, line: 49, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitStream", file: !12, line: 13, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 8, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !103, file: !12, line: 9, baseType: !35, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !103, file: !12, line: 10, baseType: !32, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buffLive", scope: !103, file: !12, line: 11, baseType: !32, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !103, file: !12, line: 12, baseType: !26, size: 8, offset: 128)
!109 = !DILocation(line: 49, column: 17, scope: !11)
!110 = !DILocalVariable(name: "bsWr", scope: !11, file: !12, line: 49, type: !101)
!111 = !DILocation(line: 49, column: 24, scope: !11)
!112 = !DILocalVariable(name: "bitsRead", scope: !11, file: !12, line: 50, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !12, line: 2, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!115 = !DILocation(line: 50, column: 17, scope: !11)
!116 = !DILocalVariable(name: "buffHi", scope: !11, file: !12, line: 50, type: !113)
!117 = !DILocation(line: 50, column: 27, scope: !11)
!118 = !DILocalVariable(name: "buffLo", scope: !11, file: !12, line: 50, type: !113)
!119 = !DILocation(line: 50, column: 35, scope: !11)
!120 = !DILocalVariable(name: "blockCRC", scope: !11, file: !12, line: 50, type: !113)
!121 = !DILocation(line: 50, column: 43, scope: !11)
!122 = !DILocalVariable(name: "currBlock", scope: !11, file: !12, line: 50, type: !113)
!123 = !DILocation(line: 50, column: 53, scope: !11)
!124 = !DILocalVariable(name: "str", scope: !11, file: !12, line: 51, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 480, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 60)
!128 = !DILocation(line: 51, column: 10, scope: !11)
!129 = !DILocation(line: 53, column: 22, scope: !11)
!130 = !DILocation(line: 53, column: 14, scope: !11)
!131 = !DILocation(line: 53, column: 12, scope: !11)
!132 = !DILocation(line: 54, column: 9, scope: !133)
!133 = distinct !DILexicalBlock(scope: !11, file: !12, line: 54, column: 9)
!134 = !DILocation(line: 54, column: 16, scope: !133)
!135 = !DILocation(line: 54, column: 9, scope: !11)
!136 = !DILocation(line: 55, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !133, file: !12, line: 54, column: 25)
!138 = !DILocation(line: 57, column: 31, scope: !11)
!139 = !DILocation(line: 57, column: 12, scope: !11)
!140 = !DILocation(line: 57, column: 10, scope: !11)
!141 = !DILocation(line: 59, column: 14, scope: !11)
!142 = !DILocation(line: 60, column: 21, scope: !11)
!143 = !DILocation(line: 60, column: 12, scope: !11)
!144 = !DILocation(line: 61, column: 15, scope: !11)
!145 = !DILocation(line: 62, column: 12, scope: !11)
!146 = !DILocation(line: 62, column: 5, scope: !11)
!147 = !DILocation(line: 62, column: 23, scope: !11)
!148 = !DILocation(line: 63, column: 5, scope: !11)
!149 = !DILocation(line: 64, column: 22, scope: !150)
!150 = distinct !DILexicalBlock(scope: !11, file: !12, line: 63, column: 15)
!151 = !DILocation(line: 64, column: 13, scope: !150)
!152 = !DILocation(line: 64, column: 11, scope: !150)
!153 = !DILocation(line: 65, column: 17, scope: !150)
!154 = !DILocation(line: 66, column: 13, scope: !155)
!155 = distinct !DILexicalBlock(scope: !150, file: !12, line: 66, column: 13)
!156 = !DILocation(line: 66, column: 15, scope: !155)
!157 = !DILocation(line: 66, column: 13, scope: !150)
!158 = !DILocation(line: 67, column: 17, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !12, line: 67, column: 17)
!160 = distinct !DILexicalBlock(scope: !155, file: !12, line: 66, column: 21)
!161 = !DILocation(line: 67, column: 36, scope: !159)
!162 = !DILocation(line: 67, column: 29, scope: !159)
!163 = !DILocation(line: 67, column: 26, scope: !159)
!164 = !DILocation(line: 67, column: 47, scope: !159)
!165 = !DILocation(line: 68, column: 18, scope: !159)
!166 = !DILocation(line: 68, column: 36, scope: !159)
!167 = !DILocation(line: 68, column: 29, scope: !159)
!168 = !DILocation(line: 68, column: 27, scope: !159)
!169 = !DILocation(line: 68, column: 48, scope: !159)
!170 = !DILocation(line: 67, column: 17, scope: !160)
!171 = !DILocation(line: 69, column: 17, scope: !172)
!172 = distinct !DILexicalBlock(scope: !159, file: !12, line: 68, column: 55)
