; ModuleID = 'linux_bc/ikos_cases/fileread3.ll'
source_filename = "/home/SVF-tools/SSE-TestCases/src/ikos_cases/fileread3.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BitStream = type { %struct._IO_FILE*, i32, i32, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main(i32 %argc, i8** %argv) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %argc.addr = alloca i32, align 4
  %argv.addr = alloca i8**, align 8
  %inFileName = alloca [35 x i8], align 16
  %bStart = alloca [35 x i32], align 16
  %inFile = alloca %struct._IO_FILE*, align 8
  %outFile = alloca %struct._IO_FILE*, align 8
  %b = alloca i32, align 4
  %bsIn = alloca %struct.BitStream*, align 8
  %bsWr = alloca %struct.BitStream*, align 8
  %bitsRead = alloca i32, align 4
  %buffHi = alloca i32, align 4
  %buffLo = alloca i32, align 4
  %blockCRC = alloca i32, align 4
  %currBlock = alloca i32, align 4
  %str = alloca [60 x i8], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/SVF-tools/SSE-TestCases/src/ikos_cases/fileread3.c", directory: "/home/SVF-tools/SSE-TestCases")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{i32 7, !"uwtable", i32 1}
!9 = !{i32 7, !"frame-pointer", i32 2}
!10 = !{!"clang version 13.0.0"}
!11 = distinct !DISubprogram(name: "main", scope: !12, file: !12, line: 43, type: !13, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!12 = !DIFile(filename: "src/ikos_cases/fileread3.c", directory: "/home/SVF-tools/SSE-TestCases")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !16}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !12, line: 43, type: !15)
!20 = !DILocation(line: 43, column: 14, scope: !11)
!21 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !12, line: 43, type: !16)
!22 = !DILocation(line: 43, column: 27, scope: !11)
!23 = !DILocalVariable(name: "inFileName", scope: !11, file: !12, line: 44, type: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 280, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !12, line: 5, baseType: !18)
!26 = !{!27}
!27 = !DISubrange(count: 35)
!28 = !DILocation(line: 44, column: 10, scope: !11)
!29 = !DILocalVariable(name: "bStart", scope: !11, file: !12, line: 45, type: !30)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1120, elements: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !12, line: 3, baseType: !15)
!32 = !DILocation(line: 45, column: 11, scope: !11)
!33 = !DILocalVariable(name: "inFile", scope: !11, file: !12, line: 46, type: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 7, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !57, !58, !59, !63, !65, !67, !71, !74, !76, !79, !82, !83, !84, !88, !89}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 51, baseType: !15, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 54, baseType: !17, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 55, baseType: !17, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 56, baseType: !17, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 57, baseType: !17, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 58, baseType: !17, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 59, baseType: !17, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 60, baseType: !17, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 61, baseType: !17, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 64, baseType: !17, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 65, baseType: !17, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 66, baseType: !17, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 70, baseType: !56, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 72, baseType: !15, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 73, baseType: !15, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 74, baseType: !60, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 152, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!62 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 77, baseType: !64, size: 16, offset: 1024)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 78, baseType: !66, size: 8, offset: 1040)
!66 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 79, baseType: !68, size: 8, offset: 1048)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 81, baseType: !72, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 43, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 89, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 153, baseType: !62)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !37, file: !38, line: 91, baseType: !77, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !38, line: 37, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !37, file: !38, line: 92, baseType: !80, size: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !38, line: 38, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !37, file: !38, line: 93, baseType: !56, size: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !37, file: !38, line: 94, baseType: !4, size: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "SVF/llvm-13.0.0.obj/lib/clang/13.0.0/include/stddef.h", directory: "/home/SVF-tools")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 96, baseType: !15, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DILocation(line: 46, column: 17, scope: !11)
!94 = !DILocalVariable(name: "outFile", scope: !11, file: !12, line: 47, type: !34)
!95 = !DILocation(line: 47, column: 17, scope: !11)
!96 = !DILocalVariable(name: "b", scope: !11, file: !12, line: 48, type: !31)
!97 = !DILocation(line: 48, column: 12, scope: !11)
!98 = !DILocalVariable(name: "bsIn", scope: !11, file: !12, line: 49, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitStream", file: !12, line: 13, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 8, size: 192, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !101, file: !12, line: 9, baseType: !34, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !101, file: !12, line: 10, baseType: !31, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buffLive", scope: !101, file: !12, line: 11, baseType: !31, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !101, file: !12, line: 12, baseType: !25, size: 8, offset: 128)
!107 = !DILocation(line: 49, column: 17, scope: !11)
!108 = !DILocalVariable(name: "bsWr", scope: !11, file: !12, line: 49, type: !99)
!109 = !DILocation(line: 49, column: 24, scope: !11)
!110 = !DILocalVariable(name: "bitsRead", scope: !11, file: !12, line: 50, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !12, line: 2, baseType: !112)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !DILocation(line: 50, column: 17, scope: !11)
!114 = !DILocalVariable(name: "buffHi", scope: !11, file: !12, line: 50, type: !111)
!115 = !DILocation(line: 50, column: 27, scope: !11)
!116 = !DILocalVariable(name: "buffLo", scope: !11, file: !12, line: 50, type: !111)
!117 = !DILocation(line: 50, column: 35, scope: !11)
!118 = !DILocalVariable(name: "blockCRC", scope: !11, file: !12, line: 50, type: !111)
!119 = !DILocation(line: 50, column: 43, scope: !11)
!120 = !DILocalVariable(name: "currBlock", scope: !11, file: !12, line: 50, type: !111)
!121 = !DILocation(line: 50, column: 53, scope: !11)
!122 = !DILocalVariable(name: "str", scope: !11, file: !12, line: 51, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 480, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 60)
!126 = !DILocation(line: 51, column: 10, scope: !11)
!127 = !DILocation(line: 53, column: 22, scope: !11)
!128 = !DILocation(line: 53, column: 14, scope: !11)
!129 = !DILocation(line: 53, column: 12, scope: !11)
!130 = !DILocation(line: 54, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !11, file: !12, line: 54, column: 9)
!132 = !DILocation(line: 54, column: 16, scope: !131)
!133 = !DILocation(line: 54, column: 9, scope: !11)
!134 = !DILocation(line: 55, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !131, file: !12, line: 54, column: 25)
!136 = !DILocation(line: 57, column: 31, scope: !11)
!137 = !DILocation(line: 57, column: 12, scope: !11)
!138 = !DILocation(line: 57, column: 10, scope: !11)
!139 = !DILocation(line: 59, column: 14, scope: !11)
!140 = !DILocation(line: 60, column: 21, scope: !11)
!141 = !DILocation(line: 60, column: 12, scope: !11)
!142 = !DILocation(line: 61, column: 15, scope: !11)
!143 = !DILocation(line: 62, column: 12, scope: !11)
!144 = !DILocation(line: 62, column: 5, scope: !11)
!145 = !DILocation(line: 62, column: 23, scope: !11)
!146 = !DILocation(line: 63, column: 5, scope: !11)
!147 = !DILocation(line: 64, column: 22, scope: !148)
!148 = distinct !DILexicalBlock(scope: !11, file: !12, line: 63, column: 15)
!149 = !DILocation(line: 64, column: 13, scope: !148)
!150 = !DILocation(line: 64, column: 11, scope: !148)
!151 = !DILocation(line: 65, column: 17, scope: !148)
!152 = !DILocation(line: 66, column: 13, scope: !153)
!153 = distinct !DILexicalBlock(scope: !148, file: !12, line: 66, column: 13)
!154 = !DILocation(line: 66, column: 15, scope: !153)
!155 = !DILocation(line: 66, column: 13, scope: !148)
!156 = !DILocation(line: 67, column: 17, scope: !157)
!157 = distinct !DILexicalBlock(scope: !158, file: !12, line: 67, column: 17)
!158 = distinct !DILexicalBlock(scope: !153, file: !12, line: 66, column: 21)
!159 = !DILocation(line: 67, column: 36, scope: !157)
!160 = !DILocation(line: 67, column: 29, scope: !157)
!161 = !DILocation(line: 67, column: 26, scope: !157)
!162 = !DILocation(line: 67, column: 47, scope: !157)
!163 = !DILocation(line: 68, column: 18, scope: !157)
!164 = !DILocation(line: 68, column: 36, scope: !157)
!165 = !DILocation(line: 68, column: 29, scope: !157)
!166 = !DILocation(line: 68, column: 27, scope: !157)
!167 = !DILocation(line: 68, column: 48, scope: !157)
!168 = !DILocation(line: 67, column: 17, scope: !158)
!169 = !DILocation(line: 69, column: 17, scope: !170)
!170 = distinct !DILexicalBlock(scope: !157, file: !12, line: 68, column: 55)
