; ModuleID = 'linux_bc/ikos_cases/fileread6.ll'
source_filename = "/home/SVF-tools/SSE-TestCases/src/ikos_cases/fileread6.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BitStream = type { %struct._IO_FILE*, i32, i32, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main(i32 %argc, i8** %argv) #0 !dbg !11 {
entry:
  %retval = alloca i32, align 4
  %argc.addr = alloca i32, align 4
  %argv.addr = alloca i8**, align 8
  %inFileName = alloca [35 x i8], align 16
  %bStart = alloca [35 x i32], align 16
  %bEnd = alloca [35 x i32], align 16
  %inFile = alloca %struct._IO_FILE*, align 8
  %outFile = alloca %struct._IO_FILE*, align 8
  %b = alloca i32, align 4
  %bsIn = alloca %struct.BitStream*, align 8
  %bsWr = alloca %struct.BitStream*, align 8
  %bitsRead = alloca i32, align 4
  %buffHi = alloca i32, align 4
  %buffLo = alloca i32, align 4
  %blockCRC = alloca i32, align 4
  %currBlock = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/SVF-tools/SSE-TestCases/src/ikos_cases/fileread6.c", directory: "/home/SVF-tools/SSE-TestCases")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{i32 7, !"uwtable", i32 1}
!9 = !{i32 7, !"frame-pointer", i32 2}
!10 = !{!"clang version 13.0.0"}
!11 = distinct !DISubprogram(name: "main", scope: !12, file: !12, line: 48, type: !13, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!12 = !DIFile(filename: "src/ikos_cases/fileread6.c", directory: "/home/SVF-tools/SSE-TestCases")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !16}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !12, line: 48, type: !15)
!20 = !DILocation(line: 48, column: 14, scope: !11)
!21 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !12, line: 48, type: !16)
!22 = !DILocation(line: 48, column: 27, scope: !11)
!23 = !DILocalVariable(name: "inFileName", scope: !11, file: !12, line: 49, type: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 280, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !12, line: 5, baseType: !18)
!26 = !{!27}
!27 = !DISubrange(count: 35)
!28 = !DILocation(line: 49, column: 10, scope: !11)
!29 = !DILocalVariable(name: "bStart", scope: !11, file: !12, line: 50, type: !30)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1120, elements: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !12, line: 3, baseType: !15)
!32 = !DILocation(line: 50, column: 11, scope: !11)
!33 = !DILocalVariable(name: "bEnd", scope: !11, file: !12, line: 51, type: !30)
!34 = !DILocation(line: 51, column: 11, scope: !11)
!35 = !DILocalVariable(name: "inFile", scope: !11, file: !12, line: 52, type: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 7, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 49, size: 1728, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !57, !59, !60, !61, !65, !67, !69, !73, !76, !78, !81, !84, !85, !86, !90, !91}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 51, baseType: !15, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 54, baseType: !17, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 55, baseType: !17, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 56, baseType: !17, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 57, baseType: !17, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 58, baseType: !17, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 59, baseType: !17, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 60, baseType: !17, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 61, baseType: !17, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 64, baseType: !17, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 65, baseType: !17, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 66, baseType: !17, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 68, baseType: !55, size: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 36, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 70, baseType: !58, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 72, baseType: !15, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 73, baseType: !15, size: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 74, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 152, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!64 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 77, baseType: !66, size: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 78, baseType: !68, size: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 79, baseType: !70, size: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 81, baseType: !74, size: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 43, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 89, baseType: !77, size: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 153, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !39, file: !40, line: 91, baseType: !79, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !40, line: 37, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !39, file: !40, line: 92, baseType: !82, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !40, line: 38, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !39, file: !40, line: 93, baseType: !58, size: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !39, file: !40, line: 94, baseType: !4, size: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 95, baseType: !87, size: 64, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "SVF/llvm-13.0.0.obj/lib/clang/13.0.0/include/stddef.h", directory: "/home/SVF-tools")
!89 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 96, baseType: !15, size: 32, offset: 1536)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 98, baseType: !92, size: 160, offset: 1568)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 20)
!95 = !DILocation(line: 52, column: 17, scope: !11)
!96 = !DILocalVariable(name: "outFile", scope: !11, file: !12, line: 53, type: !36)
!97 = !DILocation(line: 53, column: 17, scope: !11)
!98 = !DILocalVariable(name: "b", scope: !11, file: !12, line: 54, type: !31)
!99 = !DILocation(line: 54, column: 12, scope: !11)
!100 = !DILocalVariable(name: "bsIn", scope: !11, file: !12, line: 55, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitStream", file: !12, line: 18, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 13, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !103, file: !12, line: 14, baseType: !36, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !103, file: !12, line: 15, baseType: !31, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buffLive", scope: !103, file: !12, line: 16, baseType: !31, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !103, file: !12, line: 17, baseType: !25, size: 8, offset: 128)
!109 = !DILocation(line: 55, column: 17, scope: !11)
!110 = !DILocalVariable(name: "bsWr", scope: !11, file: !12, line: 55, type: !101)
!111 = !DILocation(line: 55, column: 24, scope: !11)
!112 = !DILocalVariable(name: "bitsRead", scope: !11, file: !12, line: 56, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !12, line: 2, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!115 = !DILocation(line: 56, column: 17, scope: !11)
!116 = !DILocalVariable(name: "buffHi", scope: !11, file: !12, line: 56, type: !113)
!117 = !DILocation(line: 56, column: 27, scope: !11)
!118 = !DILocalVariable(name: "buffLo", scope: !11, file: !12, line: 56, type: !113)
!119 = !DILocation(line: 56, column: 35, scope: !11)
!120 = !DILocalVariable(name: "blockCRC", scope: !11, file: !12, line: 56, type: !113)
!121 = !DILocation(line: 56, column: 43, scope: !11)
!122 = !DILocalVariable(name: "currBlock", scope: !11, file: !12, line: 56, type: !113)
!123 = !DILocation(line: 56, column: 53, scope: !11)
!124 = !DILocalVariable(name: "str", scope: !11, file: !12, line: 57, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 480, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 60)
!128 = !DILocation(line: 57, column: 10, scope: !11)
!129 = !DILocation(line: 59, column: 22, scope: !11)
!130 = !DILocation(line: 59, column: 14, scope: !11)
!131 = !DILocation(line: 59, column: 12, scope: !11)
!132 = !DILocation(line: 60, column: 9, scope: !133)
!133 = distinct !DILexicalBlock(scope: !11, file: !12, line: 60, column: 9)
!134 = !DILocation(line: 60, column: 16, scope: !133)
!135 = !DILocation(line: 60, column: 9, scope: !11)
!136 = !DILocation(line: 61, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !133, file: !12, line: 60, column: 25)
!138 = !DILocation(line: 63, column: 31, scope: !11)
!139 = !DILocation(line: 63, column: 12, scope: !11)
!140 = !DILocation(line: 63, column: 10, scope: !11)
!141 = !DILocation(line: 65, column: 14, scope: !11)
!142 = !DILocation(line: 66, column: 21, scope: !11)
!143 = !DILocation(line: 66, column: 12, scope: !11)
!144 = !DILocation(line: 67, column: 15, scope: !11)
!145 = !DILocation(line: 68, column: 12, scope: !11)
!146 = !DILocation(line: 68, column: 5, scope: !11)
!147 = !DILocation(line: 68, column: 23, scope: !11)
!148 = !DILocation(line: 69, column: 5, scope: !11)
!149 = !DILocation(line: 70, column: 22, scope: !150)
!150 = distinct !DILexicalBlock(scope: !11, file: !12, line: 69, column: 15)
!151 = !DILocation(line: 70, column: 13, scope: !150)
!152 = !DILocation(line: 70, column: 11, scope: !150)
!153 = !DILocation(line: 71, column: 17, scope: !150)
!154 = !DILocation(line: 72, column: 13, scope: !155)
!155 = distinct !DILexicalBlock(scope: !150, file: !12, line: 72, column: 13)
!156 = !DILocation(line: 72, column: 15, scope: !155)
!157 = !DILocation(line: 72, column: 13, scope: !150)
!158 = !DILocation(line: 73, column: 17, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !12, line: 73, column: 17)
!160 = distinct !DILexicalBlock(scope: !155, file: !12, line: 72, column: 21)
!161 = !DILocation(line: 73, column: 36, scope: !159)
!162 = !DILocation(line: 73, column: 29, scope: !159)
!163 = !DILocation(line: 73, column: 26, scope: !159)
!164 = !DILocation(line: 73, column: 47, scope: !159)
!165 = !DILocation(line: 74, column: 18, scope: !159)
!166 = !DILocation(line: 74, column: 36, scope: !159)
!167 = !DILocation(line: 74, column: 29, scope: !159)
!168 = !DILocation(line: 74, column: 27, scope: !159)
!169 = !DILocation(line: 74, column: 48, scope: !159)
!170 = !DILocation(line: 73, column: 17, scope: !160)
!171 = !DILocation(line: 75, column: 35, scope: !159)
!172 = !DILocation(line: 75, column: 43, scope: !159)
!173 = !DILocation(line: 75, column: 22, scope: !159)
